import spacy


nlp_ner = spacy.load("output/model-best")

doc = nlp_ner("با گذشت زمان و معرفی اتریوم به عنوان رقیبی قدرتمند برای بیت‌کوین، رفته رفته سهم پادشاه از بازار کاسته شد. پس از معرفی ارزهای قدرتمندی مثل سولانا و کاردانو، دسته‌بندی‌های دیگری بر اساس کاربرد توکن‌ها ایجاد شد که شامل موارد زیر می‌شود: استیبل کوین‌ توکن کاربردی توکن زیرساختی توکن‌ غیرمثلی (NFT) توکن اوراق بهادار توکن حاکمیتی توکن دیفای در ادامه به توضیح کامل هر کدام از این موارد خواهیم پرداخت.")
for ent in doc.ents:
    print(ent.text, ent.start_char, ent.end_char, ent.label_)